
  
    
      
    
  ## 常用聚类分析方法
  
  类别           |主要算法                                                                            |
  ---------------|-----------------------------------------------------------------------------------|
  划分（分裂）算法| k-Mean算法、K-MEDOIDS算法、CLARANS算法                                              |
  层次分析方法    |BIRCH算法（平衡迭代规约和聚类）、CURE算法（代表点聚类）、CHAMELEON算法（动态模型）       |
  基于密度的方法  |DBSCAN算法（基于高密度连接区域）、DENCLUE算法（代表点聚类）、CHAMELEON算法（对象排序识别）|
  基于网格的方法  |STING算法（统计信息网络）、CLIOUE算法（聚类高维空间）、WAVE-CLUSTER算法（小波变换）      |
  基于模型的方法  |统计学方法、神经网络方法                                                              |
